Repository: digogid/ValidateMe
Catalog: ValidateMe.Resources/Resources.*.resx
Languages: pt

# HasMoreThanNeededDays
source: {0} must has up to {1} days
pt: {0} deve ter até {1} dias

# HasMoreThanNeededYears
source: {0} must has up to {1} years
pt: {0} deve ter até {1} anos

# HasNotEnoughDays
source: {0} must has at least {1} days until now
pt: {0} deve ter, ao menos, {1} dias até hoje

# HasNotEnoughYears
source: {0} must has at least {1} years until now
pt: {0} deve ter, ao menos, {1} anos até hoje

# HasNotExactLength
source: {0} must has exactly {1} characters
pt: {0} deve ter exatamente {1} caracteres

# HasNotMinimumWords
source: {0} must contains at least {1} words
pt: {0} deve ter, ao menos, {1} palavras

# HasNoSpecialCharacters
source: {0} does not contains any special character
pt: {0} não contém nenhum caracter especial

# HasNoValue
source: {0} is required
pt: {0} é obrigatório

# IsNotAfternoon
source: {0} must be afternoon
pt: {0} deve ser à tarde

# IsNotAlphabetic
source: {0} must contains only letters
pt: {0} deve conter apenas letras

# IsNotAlphanumeric
source: {0} must contains at least one letter and one number
pt: {0} deve conter ao menos uma letra e um algarismo

# IsNotDawn
source: {0} must be dawn
pt: {0} deve ser de madrugada

# IsNotEmail
source: {0} is not a valid email
pt: {0} não é um e-mail válido

# IsNotEqual
source: {0} must be equals to {1}
pt: {0} deve ser igual a {1}

# IsNotEven
source: {0} must be even
pt: {0} deve ser um número par

# IsNotEvening
source: {0} must be evening
pt: {0} deve ser à noite

# IsNotGreaterThan
source: {0} must be greater than {1} {2}
pt: {0} deve ser maior que {1} {2}

# IsNotGuid
source: {0} must be in Guid format
pt: {0} deve estar no formato de um Guid

# IsNotInFuture
source: {0} must be in the future
pt: {0} deve estar no futuro

# IsNotInLast24Hours
source: {0} must be in last 24 hours
pt: {0} deve estar nas últimas 24 horas

# IsNotInLast365Days
source: {0} must be in the last 365 days
pt: {0} deve estar nos últimos 365 dias

# IsNotInNext24Hours
source: {0} must be in next 24 hours
pt: {0} deve estar nas próximas 24 horas

# IsNotInNext365Days
source: {0} must be in the next 365 days
pt: {0} deve estar nos próximos 365 dias

# IsNotInPast
source: {0} must be in the past
pt: {0} deve estar no passado

# IsNotLeapYear
source: {0} must be a leap year
pt: {0} deve ser ano bissexto

# IsNotMoreRecentThan
source: {0} must be more recent than {1}
pt: {0} deve ser mais recente que {1}

# IsNotMorning
source: {0} must be morning
pt: {0} deve ser de manhã

# IsNotNegative
source: {0} must be a negative number
pt: {0} deve ser um número negativo

# IsNotNumeric
source: {0} must contains only numbers
pt: {0} deve conter apenas números

# IsNotOdd
source: {0} must be odd
pt: {0} deve ser um número ímpar

# IsNotOlderThan
source: {0} must be older than {1}
pt: {0} deve ser mais antigo que {1}

# IsNotPositive
source: {0} must be a positive number
pt: {0} deve ser um número positivo

# IsNotSafe
source: {0} does not match our security patterns
pt: {0} não confere com nossos padrões de segurança

# IsNotSmallerThan
source: {0} must be smaller than {1} {2}
pt: {0} deve ser menor que {1} {2}

# IsNotToday
source: {0} must be today
pt: {0} deve ser hoje

# IsNotTomorrow
source: {0} must be tomorrow
pt: {0} deve ser amanhã

# IsNotWeekday
source: {0} must be weekday
pt: {0} deve ser dia de semana

# IsNotWeekend
source: {0} must be weekend
pt: {0} deve ser final de semana

# IsNotYesterday
source: {0} must be yesterday
pt: {0} deve ser ontem

# IsNotZero
source: {0} must be zero
pt: {0} deve ser zero

# Misformatted
source: {0} is not well formatted
pt: {0} não está bem formatado

# IncorrectType
source: {0} was expected. Got {1} instead
pt: {0} era esperado. Foi recebido {1} em seu lugar.

# IsNotDifferentFrom
source: {0} must be diffrent from {1}
pt: {0} deve ser diferente de {1}

# IsNotGreaterOrEqualTo
source: {0} must be greater or equal to {1}
pt: {0} deve ser maior ou igual a {1}

# IsNotSmallerOrEqualTo
source: {0} must be smaller or equal to {1}
pt: {0} deve ser menor ou igual a {1}
